#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 3f5d97c74e55c8ae5596a1f3dc7347d1.pdb
; shader hash: 3f5d97c74e55c8ae5596a1f3dc7347d1
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RaytracingSampleConstantBuffer
;       {
;
;           column_major float4x4 projectionToWorld;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:    80
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_rayGenCB                        cbuffer      NA          NA     CB0            cb0     1
; Scene                             texture     i32         ras      T0             t0     1
; tex_diffuse                       texture     f32          2d      T1             t1     1
; Vertices                          texture    byte         r/o      T2             t2     1
; Indices                           texture    byte         r/o      T3             t3     1
; RenderTarget                          UAV     f32          2d      U0             u0     1
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !90)
!1 = !DIFile(filename: "..\5C..\5Cshaders\5CRaytracingSample.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 23, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 23, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 61, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 61, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 61, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 115, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 115, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 115, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 115, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 158, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 158, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 158, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 158, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 158, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!38, !23}
!38 = !DITemplateTypeParameter(name: "element", type: !15)
!39 = !{!40, !43, !56, !65, !76, !79}
!40 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 59, type: !41, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!41 = !DISubroutineType(types: !42)
!42 = !{null}
!43 = !DISubprogram(name: "GetIndices", linkageName: "\01?GetIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 87, type: !44, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !55}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 81, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 81, size: 96, align: 32, elements: !48, templateParams: !53)
!48 = !{!49, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !47, file: !1, line: 81, baseType: !50, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !47, file: !1, line: 81, baseType: !50, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !47, file: !1, line: 81, baseType: !50, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!53 = !{!54, !23}
!54 = !DITemplateTypeParameter(name: "element", type: !50)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 81, baseType: !50)
!56 = !DISubprogram(name: "GetVertexAttributes", linkageName: "\01?GetVertexAttributes@@YA?AUVertexAttributes@@IV?$vector@M$02@@@Z", scope: !1, file: !1, line: 117, type: !57, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !55, !16}
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexAttributes", file: !1, line: 25, size: 352, align: 32, elements: !60)
!60 = !{!61, !62, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !59, file: !1, line: 27, baseType: !16, size: 96, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !59, file: !1, line: 28, baseType: !16, size: 96, align: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !59, file: !1, line: 29, baseType: !16, size: 96, align: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !59, file: !1, line: 30, baseType: !24, size: 64, align: 32, offset: 288)
!65 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 151, type: !66, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !72}
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 37, size: 128, align: 32, elements: !70)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !69, file: !1, line: 39, baseType: !4, size: 128, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 36, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 147, size: 64, align: 32, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !73, file: !1, line: 147, baseType: !25, size: 64, align: 32)
!76 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 162, type: !77, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!77 = !DISubroutineType(types: !78)
!78 = !{null, !68}
!79 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 42, type: !80, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82, !88, !88}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 99, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 99, size: 64, align: 32, elements: !84, templateParams: !87)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !83, file: !1, line: 99, baseType: !50, size: 32, align: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !83, file: !1, line: 99, baseType: !50, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!87 = !{!54, !30}
!88 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!90 = !{!91, !119, !121, !123, !127, !129, !131}
!91 = !DIGlobalVariable(name: "g_rayGenCB", linkageName: "\01?g_rayGenCB@0@3URaytracingSampleConstantBuffer@@B", scope: !0, file: !1, line: 23, type: !92, isLocal: false, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingSampleConstantBuffer", file: !1, line: 15, size: 640, align: 32, elements: !94)
!94 = !{!95, !118}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "projectionToWorld", scope: !93, file: !1, line: 17, baseType: !96, size: 512, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !98, templateParams: !115)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !97, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!115 = !{!13, !116, !117}
!116 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!117 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !93, file: !1, line: 18, baseType: !4, size: 128, align: 32, offset: 512)
!119 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 77, type: !120, isLocal: true, isDefinition: true, variable: i32 16)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!121 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 21, type: !122, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 21, size: 32, align: 32, elements: !2)
!123 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !124, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !125)
!125 = !{!126}
!126 = !DITemplateTypeParameter(name: "element", type: !5)
!127 = !DIGlobalVariable(name: "tex_diffuse", linkageName: "\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 32, type: !128, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A")
!128 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 32, size: 160, align: 32, elements: !2, templateParams: !125)
!129 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 33, type: !130, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Vertices@@3UByteAddressBuffer@@A")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 33, size: 32, align: 32, elements: !2)
!131 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 34, type: !130, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!132 = !{i32 2, !"Dwarf Version", i32 4}
!133 = !{i32 2, !"Debug Info Version", i32 3}
!134 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!135 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_SAMPLE_HLSL\0D\0A#define RAYTRACING_SAMPLE_HLSL\0D\0A\0D\0Astruct RaytracingSampleConstantBuffer\0D\0A{\0D\0A    float4x4 projectionToWorld;\0D\0A    float4 cameraPosition;\0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0AConstantBuffer<RaytracingSampleConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0Astruct VertexAttributes\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float3 tangent;\0D\0A    float2 uv;\0D\0A};\0D\0ATexture2D<float4> tex_diffuse : register(t1);\0D\0AByteAddressBuffer Vertices : register(t2);\0D\0AByteAddressBuffer Indices : register(t3);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(g_rayGenCB.projectionToWorld, float4(screenPos, 0, 1));\0D\0A\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_rayGenCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin);\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10.0;\0D\0A    RayPayload payload = { float4(0, 1, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A\0D\0A\0D\0A\0D\0A// ************************************************\0D\0Auint3 GetIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3;\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A\0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes)\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff;\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    } else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0AVertexAttributes GetVertexAttributes(uint triangleIndex, float3 barycentrics)\0D\0A{\0D\0A    uint indexSizeInBytes = 2;\0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint triangleIndexStride = indicesPerTriangle * indexSizeInBytes;\0D\0A    uint baseIndex = triangleIndex * triangleIndexStride;\0D\0A\0D\0A    uint3 primitive_indices = GetIndices(baseIndex);\0D\0A    VertexAttributes v;\0D\0A    v.position = float3(0, 0, 0);\0D\0A    v.normal = float3(0, 0, 0);\0D\0A    v.tangent = float3(0, 0, 0);\0D\0A    v.uv = float2(0, 0);\0D\0A\0D\0A    for (uint i = 0; i < 3; i++)\0D\0A    {\0D\0A        int address = primitive_indices[i] * 11 * 4;\0D\0A        v.position += asfloat(Vertices.Load3(address)) * barycentrics[i];\0D\0A        address += (3 * 4);\0D\0A        \0D\0A        v.normal += asfloat(Vertices.Load3(address)) * barycentrics[i];\0D\0A        address += (3 * 4);\0D\0A\0D\0A        v.tangent += asfloat(Vertices.Load3(address)) * barycentrics[i];\0D\0A        address += (3 * 4);\0D\0A        \0D\0A        v.uv += asfloat(Vertices.Load2(address)) * barycentrics[i];\0D\0A    }\0D\0A\0D\0A    return v;\0D\0A}\0D\0A// ************************************************\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attrib)\0D\0A{\0D\0A    uint triangleIndex = PrimitiveIndex();\09\0D\0A    float3 barycentrics = float3((1.0f - attrib.barycentrics.x - attrib.barycentrics.y), attrib.barycentrics.x, attrib.barycentrics.y);\0D\0A    VertexAttributes vertex = GetVertexAttributes(triangleIndex, barycentrics);\0D\0A\0D\0A    int2 coord = floor(vertex.uv * 512.f);\0D\0A    payload.color = float4(tex_diffuse.Load(int3(coord, 0)).rgb, 1.f);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4( 0.0f, 0.4f, 0.2f, 1.0f );\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!136 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl"}
!137 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"D:\5CDX12Framework\5Cbin\5CRaytracingSample.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!138 = !{i32 1, i32 3}
!139 = !{i32 1, i32 6}
!140 = !{!"lib", i32 6, i32 3}
!141 = !{!142, !149, !151, null}
!142 = !{!143, !145, !147, !148}
!143 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !144}
!144 = !{i32 0, i32 4}
!145 = !{i32 1, %"class.Texture2D<vector<float, 4> >"* @"\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", !"tex_diffuse", i32 0, i32 1, i32 1, i32 2, i32 0, !146}
!146 = !{i32 0, i32 9}
!147 = !{i32 2, %struct.ByteAddressBuffer* @"\01?Vertices@@3UByteAddressBuffer@@A", !"Vertices", i32 0, i32 2, i32 1, i32 11, i32 0, null}
!148 = !{i32 3, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 0, i32 3, i32 1, i32 11, i32 0, null}
!149 = !{!150}
!150 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !146}
!151 = !{!152}
!152 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 80, null}
!153 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !154, %"class.RWTexture2D<vector<float, 4> >" undef, !156, %struct.RaytracingSampleConstantBuffer undef, !158, %"class.Texture2D<vector<float, 4> >" undef, !162, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !164, %struct.ByteAddressBuffer undef, !154, %struct.RayDesc undef, !166, %struct.RayPayload undef, !171, %struct.VertexAttributes undef, !173, %struct.BuiltInTriangleIntersectionAttributes undef, !178, %g_rayGenCB undef, !180}
!154 = !{i32 4, !155}
!155 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!156 = !{i32 16, !157}
!157 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!158 = !{i32 80, !159, !161}
!159 = !{i32 6, !"projectionToWorld", i32 2, !160, i32 3, i32 0, i32 7, i32 9}
!160 = !{i32 4, i32 4, i32 2}
!161 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!162 = !{i32 20, !157, !163}
!163 = !{i32 6, !"mips", i32 3, i32 16}
!164 = !{i32 4, !165}
!165 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!166 = !{i32 32, !167, !168, !169, !170}
!167 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!168 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!169 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!170 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!171 = !{i32 16, !172}
!172 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!173 = !{i32 56, !174, !175, !176, !177}
!174 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!175 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!176 = !{i32 6, !"tangent", i32 3, i32 32, i32 7, i32 9}
!177 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!178 = !{i32 8, !179}
!179 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!180 = !{i32 80, !181}
!181 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!182 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !183, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !185, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !188}
!183 = !{!184}
!184 = !{i32 1, !2, !2}
!185 = !{!184, !186, !187}
!186 = !{i32 2, !2, !2}
!187 = !{i32 0, !2, !2}
!188 = !{!184, !186}
!189 = !{null, !"", null, !141, !190}
!190 = !{i32 0, i64 65553}
!191 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !192}
!192 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !193}
!193 = !{i32 0}
!194 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !195}
!195 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !193}
!196 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !197}
!197 = !{i32 8, i32 7, i32 5, !193}
!198 = !DILocation(line: 65, column: 23, scope: !40)
!199 = !DILocation(line: 65, column: 5, scope: !40)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !79, file: !1, line: 42, type: !82)
!201 = !DIExpression(DW_OP_bit_piece, 0, 32)
!202 = !DILocation(line: 42, column: 37, scope: !79, inlinedAt: !203)
!203 = distinct !DILocation(line: 65, column: 5, scope: !40)
!204 = !DIExpression(DW_OP_bit_piece, 32, 32)
!205 = !DILocation(line: 44, column: 17, scope: !79, inlinedAt: !203)
!206 = !DILocation(line: 44, column: 23, scope: !79, inlinedAt: !203)
!207 = !DILocation(line: 44, column: 12, scope: !79, inlinedAt: !203)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !79, file: !1, line: 44, type: !24)
!209 = !DILocation(line: 45, column: 29, scope: !79, inlinedAt: !203)
!210 = !DILocation(line: 45, column: 27, scope: !79, inlinedAt: !203)
!211 = !DILocation(line: 45, column: 57, scope: !79, inlinedAt: !203)
!212 = !DILocation(line: 45, column: 63, scope: !79, inlinedAt: !203)
!213 = !DILocation(line: 45, column: 12, scope: !79, inlinedAt: !203)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !79, file: !1, line: 45, type: !24)
!215 = !DILocation(line: 48, column: 19, scope: !79, inlinedAt: !203)
!216 = !DILocation(line: 48, column: 17, scope: !79, inlinedAt: !203)
!217 = !DILocation(line: 51, column: 35, scope: !79, inlinedAt: !203)
!218 = !DILocation(line: 51, column: 20, scope: !79, inlinedAt: !203)
!219 = !DILocation(line: 51, column: 12, scope: !79, inlinedAt: !203)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !79, file: !1, line: 51, type: !4)
!221 = !DIExpression(DW_OP_bit_piece, 64, 32)
!222 = !DIExpression(DW_OP_bit_piece, 96, 32)
!223 = !DILocation(line: 53, column: 15, scope: !79, inlinedAt: !203)
!224 = !DILocation(line: 54, column: 14, scope: !79, inlinedAt: !203)
!225 = !DILocation(line: 54, column: 12, scope: !79, inlinedAt: !203)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !79, file: !1, line: 42, type: !16)
!227 = !DILocation(line: 42, column: 55, scope: !79, inlinedAt: !203)
!228 = !DILocation(line: 55, column: 37, scope: !79, inlinedAt: !203)
!229 = !DILocation(line: 55, column: 17, scope: !79, inlinedAt: !203)
!230 = !DILocation(line: 55, column: 15, scope: !79, inlinedAt: !203)
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !79, file: !1, line: 42, type: !16)
!232 = !DILocation(line: 42, column: 74, scope: !79, inlinedAt: !203)
!233 = !DILocation(line: 56, column: 1, scope: !79, inlinedAt: !203)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !40, file: !1, line: 62, type: !16)
!235 = !DILocation(line: 62, column: 12, scope: !40)
!236 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !40, file: !1, line: 61, type: !16)
!237 = !DILocation(line: 61, column: 12, scope: !40)
!238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !40, file: !1, line: 69, type: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 69, size: 256, align: 32, elements: !240)
!240 = !{!241, !242, !243, !244}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !239, file: !1, line: 69, baseType: !17, size: 96, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !239, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !239, file: !1, line: 69, baseType: !17, size: 96, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !239, file: !1, line: 69, baseType: !8, size: 32, align: 32, offset: 224)
!245 = !DIExpression()
!246 = !DILocation(line: 69, column: 13, scope: !40)
!247 = !DILocation(line: 70, column: 9, scope: !40)
!248 = !DILocation(line: 70, column: 16, scope: !40)
!249 = !DILocation(line: 71, column: 9, scope: !40)
!250 = !DILocation(line: 71, column: 19, scope: !40)
!251 = !DILocation(line: 74, column: 9, scope: !40)
!252 = !DILocation(line: 74, column: 14, scope: !40)
!253 = !DILocation(line: 75, column: 9, scope: !40)
!254 = !DILocation(line: 75, column: 14, scope: !40)
!255 = !DILocation(line: 76, column: 26, scope: !40)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !40, file: !1, line: 76, type: !69)
!257 = !DILocation(line: 76, column: 16, scope: !40)
!258 = !DILocation(line: 77, column: 5, scope: !40)
!259 = !DILocation(line: 80, column: 18, scope: !40)
!260 = !DILocation(line: 80, column: 5, scope: !40)
!261 = !DILocation(line: 80, column: 42, scope: !40)
!262 = !DILocation(line: 81, column: 1, scope: !40)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !65, file: !1, line: 151, type: !72)
!264 = !DILocation(line: 151, column: 67, scope: !65)
!265 = !DILocation(line: 153, column: 26, scope: !65)
!266 = !DILocation(line: 153, column: 10, scope: !65)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndex", scope: !65, file: !1, line: 153, type: !55)
!268 = !DILocation(line: 154, column: 49, scope: !65)
!269 = !DILocation(line: 154, column: 42, scope: !65)
!270 = !DILocation(line: 154, column: 40, scope: !65)
!271 = !DILocation(line: 154, column: 73, scope: !65)
!272 = !DILocation(line: 154, column: 66, scope: !65)
!273 = !DILocation(line: 154, column: 64, scope: !65)
!274 = !DILocation(line: 154, column: 97, scope: !65)
!275 = !DILocation(line: 154, column: 90, scope: !65)
!276 = !DILocation(line: 154, column: 120, scope: !65)
!277 = !DILocation(line: 154, column: 113, scope: !65)
!278 = !DILocation(line: 154, column: 12, scope: !65)
!279 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "barycentrics", scope: !65, file: !1, line: 154, type: !16)
!280 = !DILocation(line: 155, column: 31, scope: !65)
!281 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "triangleIndex", arg: 1, scope: !56, file: !1, line: 117, type: !55)
!282 = !DILocation(line: 117, column: 43, scope: !56, inlinedAt: !283)
!283 = distinct !DILocation(line: 155, column: 31, scope: !65)
!284 = !DILocation(line: 119, column: 10, scope: !56, inlinedAt: !283)
!285 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !56, file: !1, line: 119, type: !55)
!286 = !DILocation(line: 120, column: 10, scope: !56, inlinedAt: !283)
!287 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indicesPerTriangle", scope: !56, file: !1, line: 120, type: !55)
!288 = !DILocation(line: 121, column: 51, scope: !56, inlinedAt: !283)
!289 = !DILocation(line: 121, column: 10, scope: !56, inlinedAt: !283)
!290 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndexStride", scope: !56, file: !1, line: 121, type: !55)
!291 = !DILocation(line: 122, column: 36, scope: !56, inlinedAt: !283)
!292 = !DILocation(line: 122, column: 10, scope: !56, inlinedAt: !283)
!293 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseIndex", scope: !56, file: !1, line: 122, type: !55)
!294 = !DILocation(line: 124, column: 31, scope: !56, inlinedAt: !283)
!295 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !43, file: !1, line: 87, type: !55)
!296 = !DILocation(line: 87, column: 23, scope: !43, inlinedAt: !297)
!297 = distinct !DILocation(line: 124, column: 31, scope: !56, inlinedAt: !283)
!298 = !DILocation(line: 98, column: 49, scope: !43, inlinedAt: !297)
!299 = !DILocation(line: 98, column: 16, scope: !43, inlinedAt: !297)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dwordAlignedOffset", scope: !43, file: !1, line: 98, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!302 = !DILocation(line: 99, column: 36, scope: !43, inlinedAt: !297)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "four16BitIndices", scope: !43, file: !1, line: 99, type: !304)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!305 = !DILocation(line: 99, column: 17, scope: !43, inlinedAt: !297)
!306 = !DILocation(line: 102, column: 28, scope: !307, inlinedAt: !297)
!307 = distinct !DILexicalBlock(scope: !43, file: !1, line: 102, column: 9)
!308 = !DILocation(line: 102, column: 9, scope: !43, inlinedAt: !297)
!309 = !DILocation(line: 104, column: 40, scope: !310, inlinedAt: !297)
!310 = distinct !DILexicalBlock(scope: !307, file: !1, line: 103, column: 5)
!311 = !DILocation(line: 104, column: 19, scope: !310, inlinedAt: !297)
!312 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !43, file: !1, line: 89, type: !46)
!313 = !DILocation(line: 89, column: 11, scope: !43, inlinedAt: !297)
!314 = !DILocation(line: 105, column: 41, scope: !310, inlinedAt: !297)
!315 = !DILocation(line: 105, column: 48, scope: !310, inlinedAt: !297)
!316 = !DILocation(line: 105, column: 19, scope: !310, inlinedAt: !297)
!317 = !DILocation(line: 106, column: 40, scope: !310, inlinedAt: !297)
!318 = !DILocation(line: 106, column: 19, scope: !310, inlinedAt: !297)
!319 = !DILocation(line: 107, column: 5, scope: !310, inlinedAt: !297)
!320 = !DILocation(line: 109, column: 41, scope: !321, inlinedAt: !297)
!321 = distinct !DILexicalBlock(scope: !307, file: !1, line: 108, column: 5)
!322 = !DILocation(line: 109, column: 48, scope: !321, inlinedAt: !297)
!323 = !DILocation(line: 109, column: 19, scope: !321, inlinedAt: !297)
!324 = !DILocation(line: 110, column: 40, scope: !321, inlinedAt: !297)
!325 = !DILocation(line: 110, column: 19, scope: !321, inlinedAt: !297)
!326 = !DILocation(line: 111, column: 41, scope: !321, inlinedAt: !297)
!327 = !DILocation(line: 111, column: 48, scope: !321, inlinedAt: !297)
!328 = !DILocation(line: 111, column: 19, scope: !321, inlinedAt: !297)
!329 = !DILocation(line: 114, column: 5, scope: !43, inlinedAt: !297)
!330 = !DILocation(line: 124, column: 11, scope: !56, inlinedAt: !283)
!331 = !DILocation(line: 126, column: 16, scope: !56, inlinedAt: !283)
!332 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 0, scope: !56, file: !1, line: 125, type: !59)
!333 = !DIExpression(DW_OP_bit_piece, 0, 96)
!334 = !DILocation(line: 125, column: 22, scope: !56, inlinedAt: !283)
!335 = !DILocation(line: 127, column: 14, scope: !56, inlinedAt: !283)
!336 = !DIExpression(DW_OP_bit_piece, 96, 96)
!337 = !DILocation(line: 128, column: 15, scope: !56, inlinedAt: !283)
!338 = !DIExpression(DW_OP_bit_piece, 192, 96)
!339 = !DILocation(line: 129, column: 10, scope: !56, inlinedAt: !283)
!340 = !DIExpression(DW_OP_bit_piece, 288, 64)
!341 = !DILocation(line: 131, column: 15, scope: !342, inlinedAt: !283)
!342 = distinct !DILexicalBlock(scope: !56, file: !1, line: 131, column: 5)
!343 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !342, file: !1, line: 131, type: !55)
!344 = !DILocation(line: 131, column: 5, scope: !342, inlinedAt: !283)
!345 = !DIExpression(DW_OP_bit_piece, 192, 32)
!346 = !DIExpression(DW_OP_bit_piece, 224, 32)
!347 = !DIExpression(DW_OP_bit_piece, 256, 32)
!348 = !DIExpression(DW_OP_bit_piece, 288, 32)
!349 = !DIExpression(DW_OP_bit_piece, 320, 32)
!350 = !DIExpression(DW_OP_bit_piece, 128, 32)
!351 = !DIExpression(DW_OP_bit_piece, 160, 32)
!352 = !DILocation(line: 133, column: 23, scope: !353, inlinedAt: !283)
!353 = distinct !DILexicalBlock(scope: !354, file: !1, line: 132, column: 5)
!354 = distinct !DILexicalBlock(scope: !342, file: !1, line: 131, column: 5)
!355 = !{!356}
!356 = distinct !{!356, !357, !"\01?GetVertexAttributes@@YA?AUVertexAttributes@@IV?$vector@M$02@@@Z: %agg.result"}
!357 = distinct !{!357, !"\01?GetVertexAttributes@@YA?AUVertexAttributes@@IV?$vector@M$02@@@Z"}
!358 = !DILocation(line: 133, column: 44, scope: !353, inlinedAt: !283)
!359 = !DILocation(line: 133, column: 49, scope: !353, inlinedAt: !283)
!360 = !DILocation(line: 133, column: 13, scope: !353, inlinedAt: !283)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "address", scope: !353, file: !1, line: 133, type: !15)
!362 = !DILocation(line: 134, column: 31, scope: !353, inlinedAt: !283)
!363 = !DILocation(line: 134, column: 23, scope: !353, inlinedAt: !283)
!364 = !DILocation(line: 134, column: 58, scope: !353, inlinedAt: !283)
!365 = !DILocation(line: 134, column: 56, scope: !353, inlinedAt: !283)
!366 = !DILocation(line: 134, column: 20, scope: !353, inlinedAt: !283)
!367 = !DILocation(line: 135, column: 17, scope: !353, inlinedAt: !283)
!368 = !DILocation(line: 137, column: 29, scope: !353, inlinedAt: !283)
!369 = !DILocation(line: 137, column: 21, scope: !353, inlinedAt: !283)
!370 = !DILocation(line: 137, column: 56, scope: !353, inlinedAt: !283)
!371 = !DILocation(line: 137, column: 54, scope: !353, inlinedAt: !283)
!372 = !DILocation(line: 137, column: 18, scope: !353, inlinedAt: !283)
!373 = !DILocation(line: 138, column: 17, scope: !353, inlinedAt: !283)
!374 = !DILocation(line: 140, column: 30, scope: !353, inlinedAt: !283)
!375 = !DILocation(line: 140, column: 22, scope: !353, inlinedAt: !283)
!376 = !DILocation(line: 140, column: 57, scope: !353, inlinedAt: !283)
!377 = !DILocation(line: 140, column: 55, scope: !353, inlinedAt: !283)
!378 = !DILocation(line: 140, column: 19, scope: !353, inlinedAt: !283)
!379 = !DILocation(line: 141, column: 17, scope: !353, inlinedAt: !283)
!380 = !DILocation(line: 143, column: 25, scope: !353, inlinedAt: !283)
!381 = !DILocation(line: 143, column: 17, scope: !353, inlinedAt: !283)
!382 = !DILocation(line: 143, column: 52, scope: !353, inlinedAt: !283)
!383 = !DILocation(line: 143, column: 50, scope: !353, inlinedAt: !283)
!384 = !DILocation(line: 143, column: 14, scope: !353, inlinedAt: !283)
!385 = !DILocation(line: 131, column: 30, scope: !354, inlinedAt: !283)
!386 = !DILocation(line: 131, column: 24, scope: !354, inlinedAt: !283)
!387 = !DILocation(line: 146, column: 5, scope: !56, inlinedAt: !283)
!388 = !DILocation(line: 157, column: 34, scope: !65)
!389 = !DILocation(line: 157, column: 18, scope: !65)
!390 = !DILocation(line: 157, column: 10, scope: !65)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coord", scope: !65, file: !1, line: 157, type: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 157, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 157, size: 64, align: 32, elements: !394, templateParams: !397)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !393, file: !1, line: 157, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !393, file: !1, line: 157, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!397 = !{!38, !30}
!398 = !DILocation(line: 158, column: 28, scope: !65)
!399 = !DILocation(line: 158, column: 19, scope: !65)
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !65, file: !1, line: 151, type: !69)
!401 = !DILocation(line: 151, column: 42, scope: !65)
!402 = !DILocation(line: 159, column: 1, scope: !65)
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "barycentrics", arg: 2, scope: !56, file: !1, line: 117, type: !16)
!404 = !DILocation(line: 117, column: 65, scope: !56, inlinedAt: !283)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "primitive_indices", scope: !56, file: !1, line: 124, type: !46)
!406 = !DILocation(line: 164, column: 19, scope: !76)
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !76, file: !1, line: 162, type: !69)
!408 = !DILocation(line: 162, column: 36, scope: !76)
!409 = !DILocation(line: 165, column: 1, scope: !76)

#endif

const unsigned char g_pRaytracingSample[] = {
  0x44, 0x58, 0x42, 0x43, 0x7d, 0x11, 0x58, 0x07, 0x46, 0x6e, 0x7b, 0x18,
  0xa0, 0x2d, 0x78, 0x2b, 0x03, 0x53, 0xf8, 0xfa, 0x01, 0x00, 0x00, 0x00,
  0x20, 0x86, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0xf8, 0x02, 0x00, 0x00, 0xfc, 0x5d, 0x00, 0x00,
  0x64, 0x6e, 0x00, 0x00, 0x98, 0x6e, 0x00, 0x00, 0xb4, 0x6e, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0xa4, 0x02, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0x18, 0x01, 0x00, 0x00, 0xe8, 0x01, 0x00, 0x00, 0x7c, 0x02, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0xf8, 0x00, 0x00, 0x00, 0x00, 0x67, 0x5f, 0x72,
  0x61, 0x79, 0x47, 0x65, 0x6e, 0x43, 0x42, 0x00, 0x53, 0x63, 0x65, 0x6e,
  0x65, 0x00, 0x74, 0x65, 0x78, 0x5f, 0x64, 0x69, 0x66, 0x66, 0x75, 0x73,
  0x65, 0x00, 0x56, 0x65, 0x72, 0x74, 0x69, 0x63, 0x65, 0x73, 0x00, 0x49,
  0x6e, 0x64, 0x69, 0x63, 0x65, 0x73, 0x00, 0x52, 0x65, 0x6e, 0x64, 0x65,
  0x72, 0x54, 0x61, 0x72, 0x67, 0x65, 0x74, 0x00, 0x01, 0x3f, 0x4d, 0x79,
  0x52, 0x61, 0x79, 0x67, 0x65, 0x6e, 0x53, 0x68, 0x61, 0x64, 0x65, 0x72,
  0x40, 0x40, 0x59, 0x41, 0x58, 0x58, 0x5a, 0x00, 0x4d, 0x79, 0x52, 0x61,
  0x79, 0x67, 0x65, 0x6e, 0x53, 0x68, 0x61, 0x64, 0x65, 0x72, 0x00, 0x01,
  0x3f, 0x4d, 0x79, 0x43, 0x6c, 0x6f, 0x73, 0x65, 0x73, 0x74, 0x48, 0x69,
  0x74, 0x53, 0x68, 0x61, 0x64, 0x65, 0x72, 0x40, 0x40, 0x59, 0x41, 0x58,
  0x55, 0x52, 0x61, 0x79, 0x50, 0x61, 0x79, 0x6c, 0x6f, 0x61, 0x64, 0x40,
  0x40, 0x55, 0x42, 0x75, 0x69, 0x6c, 0x74, 0x49, 0x6e, 0x54, 0x72, 0x69,
  0x61, 0x6e, 0x67, 0x6c, 0x65, 0x49, 0x6e, 0x74, 0x65, 0x72, 0x73, 0x65,
  0x63, 0x74, 0x69, 0x6f, 0x6e, 0x41, 0x74, 0x74, 0x72, 0x69, 0x62, 0x75,
  0x74, 0x65, 0x73, 0x40, 0x40, 0x40, 0x5a, 0x00, 0x4d, 0x79, 0x43, 0x6c,
  0x6f, 0x73, 0x65, 0x73, 0x74, 0x48, 0x69, 0x74, 0x53, 0x68, 0x61, 0x64,
  0x65, 0x72, 0x00, 0x01, 0x3f, 0x4d, 0x79, 0x4d, 0x69, 0x73, 0x73, 0x53,
  0x68, 0x61, 0x64, 0x65, 0x72, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x52,
  0x61, 0x79, 0x50, 0x61, 0x79, 0x6c, 0x6f, 0x61, 0x64, 0x40, 0x40, 0x40,
  0x5a, 0x00, 0x4d, 0x79, 0x4d, 0x69, 0x73, 0x73, 0x53, 0x68, 0x61, 0x64,
  0x65, 0x72, 0x00, 0x00, 0x03, 0x00, 0x00, 0x00, 0xc8, 0x00, 0x00, 0x00,
  0x06, 0x00, 0x00, 0x00, 0x20, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
  0x0d, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x0c, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00, 0x01, 0x00, 0x00, 0x00,
