#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: 79032f28373c96e3b5b68e44efde148c.pdb
; shader hash: 79032f28373c96e3b5b68e44efde148c
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RaytracingSampleConstantBuffer
;       {
;
;           column_major float4x4 projectionToWorld;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:    80
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_rayGenCB                        cbuffer      NA          NA     CB0            cb0     1
; ss                                sampler      NA          NA      S0             s0     1
; Scene                             texture     i32         ras      T0             t0     1
; tex_diffuse                       texture     f32          2d      T1             t1     1
; Vertices                          texture    byte         r/o      T2             t2     1
; Indices                           texture    byte         r/o      T3             t3     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !82)
!1 = !DIFile(filename: "..\5C..\5Cshaders\5CRaytracingSample.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 12, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 12, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 52, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 52, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 52, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 103, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 103, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 103, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 103, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !{!32, !35, !48, !57, !68, !71}
!32 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 50, type: !33, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "GetIndices", linkageName: "\01?GetIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 75, type: !36, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !47}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 72, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 72, size: 96, align: 32, elements: !40, templateParams: !45)
!40 = !{!41, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 72, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 72, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 72, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!46, !23}
!46 = !DITemplateTypeParameter(name: "element", type: !42)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 72, baseType: !42)
!48 = !DISubprogram(name: "GetVertexAttributes", linkageName: "\01?GetVertexAttributes@@YA?AUVertexAttributes@@IV?$vector@M$02@@@Z", scope: !1, file: !1, line: 105, type: !49, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !47, !16}
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexAttributes", file: !1, line: 14, size: 352, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !51, file: !1, line: 16, baseType: !16, size: 96, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !51, file: !1, line: 17, baseType: !16, size: 96, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !51, file: !1, line: 18, baseType: !16, size: 96, align: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !51, file: !1, line: 19, baseType: !24, size: 64, align: 32, offset: 288)
!57 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 139, type: !58, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !64}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 28, size: 128, align: 32, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !61, file: !1, line: 30, baseType: !4, size: 128, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 27, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 135, size: 64, align: 32, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !65, file: !1, line: 135, baseType: !25, size: 64, align: 32)
!68 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 149, type: !69, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!69 = !DISubroutineType(types: !70)
!70 = !{null, !60}
!71 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 33, type: !72, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, !80, !80}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 87, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 87, size: 64, align: 32, elements: !76, templateParams: !79)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !75, file: !1, line: 87, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !75, file: !1, line: 87, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!79 = !{!46, !30}
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!82 = !{!83, !111, !113, !115, !119, !121, !123, !124}
!83 = !DIGlobalVariable(name: "g_rayGenCB", linkageName: "\01?g_rayGenCB@0@3URaytracingSampleConstantBuffer@@B", scope: !0, file: !1, line: 12, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingSampleConstantBuffer", file: !1, line: 4, size: 640, align: 32, elements: !86)
!86 = !{!87, !110}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "projectionToWorld", scope: !85, file: !1, line: 6, baseType: !88, size: 512, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 12, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 12, size: 512, align: 32, elements: !90, templateParams: !107)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !89, file: !1, line: 12, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!107 = !{!13, !108, !109}
!108 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!109 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !85, file: !1, line: 7, baseType: !4, size: 128, align: 32, offset: 512)
!111 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 68, type: !112, isLocal: true, isDefinition: true, variable: i32 16)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!113 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 10, type: !114, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 10, size: 32, align: 32, elements: !2)
!115 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 11, type: !116, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!116 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 11, size: 128, align: 32, elements: !2, templateParams: !117)
!117 = !{!118}
!118 = !DITemplateTypeParameter(name: "element", type: !5)
!119 = !DIGlobalVariable(name: "tex_diffuse", linkageName: "\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 21, type: !120, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A")
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 21, size: 160, align: 32, elements: !2, templateParams: !117)
!121 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 22, type: !122, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Vertices@@3UByteAddressBuffer@@A")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 22, size: 32, align: 32, elements: !2)
!123 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 23, type: !122, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!124 = !DIGlobalVariable(name: "ss", linkageName: "\01?ss@@3USamplerState@@A", scope: !0, file: !1, line: 25, type: !125, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?ss@@3USamplerState@@A")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 25, size: 32, align: 32, elements: !2)
!126 = !{i32 2, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!129 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl", !"#ifndef RAYTRACING_SAMPLE_HLSL\0D\0A#define RAYTRACING_SAMPLE_HLSL\0D\0A\0D\0Astruct RaytracingSampleConstantBuffer\0D\0A{\0D\0A    float4x4 projectionToWorld;\0D\0A    float4 cameraPosition;\0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0AConstantBuffer<RaytracingSampleConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0Astruct VertexAttributes\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float3 tangent;\0D\0A    float2 uv;\0D\0A};\0D\0ATexture2D<float4> tex_diffuse : register(t1);\0D\0AByteAddressBuffer Vertices : register(t2);\0D\0AByteAddressBuffer Indices : register(t3);\0D\0A\0D\0ASamplerState ss : register(s0);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(g_rayGenCB.projectionToWorld, float4(screenPos, 0, 1));\0D\0A\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_rayGenCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin);\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 100.0;\0D\0A    RayPayload payload = { float4(0, 1, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A// ************************************************\0D\0Auint3 GetIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3;\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A\0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes)\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff;\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    } else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0AVertexAttributes GetVertexAttributes(uint triangleIndex, float3 barycentrics)\0D\0A{\0D\0A    uint indexSizeInBytes = 2;\0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint triangleIndexStride = indicesPerTriangle * indexSizeInBytes;\0D\0A    uint baseIndex = triangleIndex * triangleIndexStride;\0D\0A\0D\0A    uint3 primitive_indices = GetIndices(baseIndex);\0D\0A    VertexAttributes v;\0D\0A    v.position = float3(0, 0, 0);\0D\0A    v.normal = float3(0, 0, 0);\0D\0A    v.tangent = float3(0, 0, 0);\0D\0A    v.uv = float2(0, 0);\0D\0A\0D\0A    for (uint i = 0; i < 3; i++)\0D\0A    {\0D\0A        int address = primitive_indices[i] * 11 * 4;\0D\0A        v.position += asfloat(Vertices.Load3(address)) * barycentrics[i];\0D\0A        address += (3 * 4);\0D\0A        \0D\0A        v.normal += asfloat(Vertices.Load3(address)) * barycentrics[i];\0D\0A        address += (3 * 4);\0D\0A\0D\0A        v.tangent += asfloat(Vertices.Load3(address)) * barycentrics[i];\0D\0A        address += (3 * 4);\0D\0A        \0D\0A        v.uv += asfloat(Vertices.Load2(address)) * barycentrics[i];\0D\0A    }\0D\0A\0D\0A    return v;\0D\0A}\0D\0A// ************************************************\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attrib)\0D\0A{\0D\0A    uint triangleIndex = PrimitiveIndex();\09\0D\0A    float3 barycentrics = float3((1.0f - attrib.barycentrics.x - attrib.barycentrics.y), attrib.barycentrics.x, attrib.barycentrics.y);\0D\0A    VertexAttributes vertex = GetVertexAttributes(triangleIndex, barycentrics);\0D\0A\0D\0A    payload.color = float4(tex_diffuse.SampleLevel(ss, vertex.uv, 0).rgb, 1.f);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4( 0.0f, 0.4f, 0.2f, 1.0f );\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!130 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl"}
!131 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"D:\5CDX12Framework\5Cbin\5CRaytracingSample.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!132 = !{i32 1, i32 3}
!133 = !{i32 1, i32 6}
!134 = !{!"lib", i32 6, i32 3}
!135 = !{!136, !143, !145, !147}
!136 = !{!137, !139, !141, !142}
!137 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !138}
!138 = !{i32 0, i32 4}
!139 = !{i32 1, %"class.Texture2D<vector<float, 4> >"* @"\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", !"tex_diffuse", i32 0, i32 1, i32 1, i32 2, i32 0, !140}
!140 = !{i32 0, i32 9}
!141 = !{i32 2, %struct.ByteAddressBuffer* @"\01?Vertices@@3UByteAddressBuffer@@A", !"Vertices", i32 0, i32 2, i32 1, i32 11, i32 0, null}
!142 = !{i32 3, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 0, i32 3, i32 1, i32 11, i32 0, null}
!143 = !{!144}
!144 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !140}
!145 = !{!146}
!146 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 80, null}
!147 = !{!148}
!148 = !{i32 0, %struct.SamplerState* @"\01?ss@@3USamplerState@@A", !"ss", i32 0, i32 0, i32 1, i32 0, null}
!149 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !150, %"class.RWTexture2D<vector<float, 4> >" undef, !152, %struct.RaytracingSampleConstantBuffer undef, !154, %"class.Texture2D<vector<float, 4> >" undef, !158, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !160, %struct.ByteAddressBuffer undef, !150, %struct.RayDesc undef, !162, %struct.RayPayload undef, !167, %struct.VertexAttributes undef, !169, %struct.BuiltInTriangleIntersectionAttributes undef, !174, %g_rayGenCB undef, !176}
!150 = !{i32 4, !151}
!151 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!152 = !{i32 16, !153}
!153 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!154 = !{i32 80, !155, !157}
!155 = !{i32 6, !"projectionToWorld", i32 2, !156, i32 3, i32 0, i32 7, i32 9}
!156 = !{i32 4, i32 4, i32 2}
!157 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!158 = !{i32 20, !153, !159}
!159 = !{i32 6, !"mips", i32 3, i32 16}
!160 = !{i32 4, !161}
!161 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!162 = !{i32 32, !163, !164, !165, !166}
!163 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!164 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!165 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!166 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!167 = !{i32 16, !168}
!168 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!169 = !{i32 56, !170, !171, !172, !173}
!170 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!171 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!172 = !{i32 6, !"tangent", i32 3, i32 32, i32 7, i32 9}
!173 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!174 = !{i32 8, !175}
!175 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!176 = !{i32 80, !177}
!177 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!178 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !179, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !181, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !184}
!179 = !{!180}
!180 = !{i32 1, !2, !2}
!181 = !{!180, !182, !183}
!182 = !{i32 2, !2, !2}
!183 = !{i32 0, !2, !2}
!184 = !{!180, !182}
!185 = !{null, !"", null, !135, !186}
!186 = !{i32 0, i64 65553}
!187 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !188}
!188 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !189}
!189 = !{i32 0}
!190 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !191}
!191 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !189}
!192 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !193}
!193 = !{i32 8, i32 7, i32 5, !189}
!194 = !DILocation(line: 56, column: 23, scope: !32)
!195 = !DILocation(line: 56, column: 5, scope: !32)
!196 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !71, file: !1, line: 33, type: !74)
!197 = !DIExpression(DW_OP_bit_piece, 0, 32)
!198 = !DILocation(line: 33, column: 37, scope: !71, inlinedAt: !199)
!199 = distinct !DILocation(line: 56, column: 5, scope: !32)
!200 = !DIExpression(DW_OP_bit_piece, 32, 32)
!201 = !DILocation(line: 35, column: 17, scope: !71, inlinedAt: !199)
!202 = !DILocation(line: 35, column: 23, scope: !71, inlinedAt: !199)
!203 = !DILocation(line: 35, column: 12, scope: !71, inlinedAt: !199)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !71, file: !1, line: 35, type: !24)
!205 = !DILocation(line: 36, column: 29, scope: !71, inlinedAt: !199)
!206 = !DILocation(line: 36, column: 27, scope: !71, inlinedAt: !199)
!207 = !DILocation(line: 36, column: 57, scope: !71, inlinedAt: !199)
!208 = !DILocation(line: 36, column: 63, scope: !71, inlinedAt: !199)
!209 = !DILocation(line: 36, column: 12, scope: !71, inlinedAt: !199)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !71, file: !1, line: 36, type: !24)
!211 = !DILocation(line: 39, column: 19, scope: !71, inlinedAt: !199)
!212 = !DILocation(line: 39, column: 17, scope: !71, inlinedAt: !199)
!213 = !DILocation(line: 42, column: 35, scope: !71, inlinedAt: !199)
!214 = !DILocation(line: 42, column: 20, scope: !71, inlinedAt: !199)
!215 = !DILocation(line: 42, column: 12, scope: !71, inlinedAt: !199)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !71, file: !1, line: 42, type: !4)
!217 = !DIExpression(DW_OP_bit_piece, 64, 32)
!218 = !DIExpression(DW_OP_bit_piece, 96, 32)
!219 = !DILocation(line: 44, column: 15, scope: !71, inlinedAt: !199)
!220 = !DILocation(line: 45, column: 14, scope: !71, inlinedAt: !199)
!221 = !DILocation(line: 45, column: 12, scope: !71, inlinedAt: !199)
!222 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !71, file: !1, line: 33, type: !16)
!223 = !DILocation(line: 33, column: 55, scope: !71, inlinedAt: !199)
!224 = !DILocation(line: 46, column: 37, scope: !71, inlinedAt: !199)
!225 = !DILocation(line: 46, column: 17, scope: !71, inlinedAt: !199)
!226 = !DILocation(line: 46, column: 15, scope: !71, inlinedAt: !199)
!227 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !71, file: !1, line: 33, type: !16)
!228 = !DILocation(line: 33, column: 74, scope: !71, inlinedAt: !199)
!229 = !DILocation(line: 47, column: 1, scope: !71, inlinedAt: !199)
!230 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !32, file: !1, line: 53, type: !16)
!231 = !DILocation(line: 53, column: 12, scope: !32)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !32, file: !1, line: 52, type: !16)
!233 = !DILocation(line: 52, column: 12, scope: !32)
!234 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !32, file: !1, line: 60, type: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 60, size: 256, align: 32, elements: !236)
!236 = !{!237, !238, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !235, file: !1, line: 60, baseType: !17, size: 96, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !235, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !235, file: !1, line: 60, baseType: !17, size: 96, align: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !235, file: !1, line: 60, baseType: !8, size: 32, align: 32, offset: 224)
!241 = !DIExpression()
!242 = !DILocation(line: 60, column: 13, scope: !32)
!243 = !DILocation(line: 61, column: 9, scope: !32)
!244 = !DILocation(line: 61, column: 16, scope: !32)
!245 = !DILocation(line: 62, column: 9, scope: !32)
!246 = !DILocation(line: 62, column: 19, scope: !32)
!247 = !DILocation(line: 65, column: 9, scope: !32)
!248 = !DILocation(line: 65, column: 14, scope: !32)
!249 = !DILocation(line: 66, column: 9, scope: !32)
!250 = !DILocation(line: 66, column: 14, scope: !32)
!251 = !DILocation(line: 67, column: 26, scope: !32)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 67, type: !61)
!253 = !DILocation(line: 67, column: 16, scope: !32)
!254 = !DILocation(line: 68, column: 5, scope: !32)
!255 = !DILocation(line: 71, column: 18, scope: !32)
!256 = !DILocation(line: 71, column: 5, scope: !32)
!257 = !DILocation(line: 71, column: 42, scope: !32)
!258 = !DILocation(line: 72, column: 1, scope: !32)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !57, file: !1, line: 139, type: !64)
!260 = !DILocation(line: 139, column: 67, scope: !57)
!261 = !DILocation(line: 141, column: 26, scope: !57)
!262 = !DILocation(line: 141, column: 10, scope: !57)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndex", scope: !57, file: !1, line: 141, type: !47)
!264 = !DILocation(line: 142, column: 49, scope: !57)
!265 = !DILocation(line: 142, column: 42, scope: !57)
!266 = !DILocation(line: 142, column: 40, scope: !57)
!267 = !DILocation(line: 142, column: 73, scope: !57)
!268 = !DILocation(line: 142, column: 66, scope: !57)
!269 = !DILocation(line: 142, column: 64, scope: !57)
!270 = !DILocation(line: 142, column: 97, scope: !57)
!271 = !DILocation(line: 142, column: 90, scope: !57)
!272 = !DILocation(line: 142, column: 120, scope: !57)
!273 = !DILocation(line: 142, column: 113, scope: !57)
!274 = !DILocation(line: 142, column: 12, scope: !57)
!275 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "barycentrics", scope: !57, file: !1, line: 142, type: !16)
!276 = !DILocation(line: 143, column: 31, scope: !57)
!277 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "triangleIndex", arg: 1, scope: !48, file: !1, line: 105, type: !47)
!278 = !DILocation(line: 105, column: 43, scope: !48, inlinedAt: !279)
!279 = distinct !DILocation(line: 143, column: 31, scope: !57)
!280 = !DILocation(line: 107, column: 10, scope: !48, inlinedAt: !279)
!281 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !48, file: !1, line: 107, type: !47)
!282 = !DILocation(line: 108, column: 10, scope: !48, inlinedAt: !279)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indicesPerTriangle", scope: !48, file: !1, line: 108, type: !47)
!284 = !DILocation(line: 109, column: 51, scope: !48, inlinedAt: !279)
!285 = !DILocation(line: 109, column: 10, scope: !48, inlinedAt: !279)
!286 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndexStride", scope: !48, file: !1, line: 109, type: !47)
!287 = !DILocation(line: 110, column: 36, scope: !48, inlinedAt: !279)
!288 = !DILocation(line: 110, column: 10, scope: !48, inlinedAt: !279)
!289 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseIndex", scope: !48, file: !1, line: 110, type: !47)
!290 = !DILocation(line: 112, column: 31, scope: !48, inlinedAt: !279)
!291 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !35, file: !1, line: 75, type: !47)
!292 = !DILocation(line: 75, column: 23, scope: !35, inlinedAt: !293)
!293 = distinct !DILocation(line: 112, column: 31, scope: !48, inlinedAt: !279)
!294 = !DILocation(line: 86, column: 49, scope: !35, inlinedAt: !293)
!295 = !DILocation(line: 86, column: 16, scope: !35, inlinedAt: !293)
