#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: efbdd05f46e95c434c12cf265bc938b2.pdb
; shader hash: efbdd05f46e95c434c12cf265bc938b2
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RaytracingSampleConstantBuffer
;       {
;
;           column_major float4x4 projectionToWorld;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;           float4 viewDirection;                     ; Offset:   80
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:    96
;
; }
;
; Resource bind info for Vertices
; {
;
;   struct struct.VertexAttributes
;   {
;
;       float3 position;                              ; Offset:    0
;       float3 normal;                                ; Offset:   12
;       float3 tangent;                               ; Offset:   24
;       float2 uv;                                    ; Offset:   36
;   
;   } $Element;                                       ; Offset:    0 Size:    44
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_rayGenCB                        cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !85)
!1 = !DIFile(filename: "..\5C..\5Cshaders\5CRaytracingSample.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 13, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 13, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 78, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 78, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 78, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 78, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 78, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 129, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 129, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 129, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 129, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !{!32, !35, !48, !57, !68, !71, !82}
!32 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 76, type: !33, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!33 = !DISubroutineType(types: !34)
!34 = !{null}
!35 = !DISubprogram(name: "GetIndices", linkageName: "\01?GetIndices@@YA?AV?$vector@I$02@@I@Z", scope: !1, file: !1, line: 101, type: !36, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !47}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 98, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 98, size: 96, align: 32, elements: !40, templateParams: !45)
!40 = !{!41, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 98, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 98, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !39, file: !1, line: 98, baseType: !42, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!45 = !{!46, !23}
!46 = !DITemplateTypeParameter(name: "element", type: !42)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 98, baseType: !42)
!48 = !DISubprogram(name: "GetVertexAttributes", linkageName: "\01?GetVertexAttributes@@YA?AUVertexAttributes@@IV?$vector@M$02@@@Z", scope: !1, file: !1, line: 131, type: !49, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !47, !16}
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexAttributes", file: !1, line: 15, size: 352, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !51, file: !1, line: 17, baseType: !16, size: 96, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !51, file: !1, line: 18, baseType: !16, size: 96, align: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tangent", scope: !51, file: !1, line: 19, baseType: !16, size: 96, align: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !51, file: !1, line: 20, baseType: !24, size: 64, align: 32, offset: 288)
!57 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 162, type: !58, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !64}
!60 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 29, size: 128, align: 32, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !61, file: !1, line: 31, baseType: !4, size: 128, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 28, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 158, size: 64, align: 32, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !65, file: !1, line: 158, baseType: !25, size: 64, align: 32)
!68 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 181, type: !69, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!69 = !DISubroutineType(types: !70)
!70 = !{null, !60}
!71 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 59, type: !72, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, !80, !80}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 113, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 113, size: 64, align: 32, elements: !76, templateParams: !79)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !75, file: !1, line: 113, baseType: !42, size: 32, align: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !75, file: !1, line: 113, baseType: !42, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!79 = !{!46, !30}
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!82 = !DISubprogram(name: "HSVtoRGB", linkageName: "\01?HSVtoRGB@@YA?AV?$vector@M$03@@MMM@Z", scope: !1, file: !1, line: 34, type: !83, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!83 = !DISubroutineType(types: !84)
!84 = !{!4, !8, !8, !8}
!85 = !{!86, !115, !117, !119, !123, !125, !129, !131}
!86 = !DIGlobalVariable(name: "g_rayGenCB", linkageName: "\01?g_rayGenCB@0@3URaytracingSampleConstantBuffer@@B", scope: !0, file: !1, line: 13, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingSampleConstantBuffer", file: !1, line: 4, size: 768, align: 32, elements: !89)
!89 = !{!90, !113, !114}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "projectionToWorld", scope: !88, file: !1, line: 6, baseType: !91, size: 512, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 13, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 13, size: 512, align: 32, elements: !93, templateParams: !110)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !92, file: !1, line: 13, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!110 = !{!13, !111, !112}
!111 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!112 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !88, file: !1, line: 7, baseType: !4, size: 128, align: 32, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "viewDirection", scope: !88, file: !1, line: 8, baseType: !4, size: 128, align: 32, offset: 640)
!115 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 94, type: !116, isLocal: true, isDefinition: true, variable: i32 16)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!117 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 11, type: !118, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 11, size: 32, align: 32, elements: !2)
!119 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 12, type: !120, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!120 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 12, size: 128, align: 32, elements: !2, templateParams: !121)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "element", type: !5)
!123 = !DIGlobalVariable(name: "tex_diffuse", linkageName: "\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !124, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A")
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 22, size: 160, align: 32, elements: !2, templateParams: !121)
!125 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UVertexAttributes@@@@A", scope: !0, file: !1, line: 23, type: !126, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<VertexAttributes>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexAttributes@@@@A")
!126 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<VertexAttributes>", file: !1, line: 23, size: 352, align: 32, elements: !2, templateParams: !127)
!127 = !{!128}
!128 = !DITemplateTypeParameter(name: "element", type: !51)
!129 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3UByteAddressBuffer@@A", scope: !0, file: !1, line: 24, type: !130, isLocal: false, isDefinition: true, variable: %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ByteAddressBuffer", file: !1, line: 24, size: 32, align: 32, elements: !2)
!131 = !DIGlobalVariable(name: "ss", linkageName: "\01?ss@@3USamplerState@@A", scope: !0, file: !1, line: 26, type: !132, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?ss@@3USamplerState@@A")
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 26, size: 32, align: 32, elements: !2)
!133 = !{i32 2, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!136 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl", !"#ifndef RAYTRACING_SAMPLE_HLSL\0D\0A#define RAYTRACING_SAMPLE_HLSL\0D\0A\0D\0Astruct RaytracingSampleConstantBuffer\0D\0A{\0D\0A    float4x4 projectionToWorld;\0D\0A    float4 cameraPosition;\0D\0A    float4 viewDirection;\0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0AConstantBuffer<RaytracingSampleConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0Astruct VertexAttributes\0D\0A{\0D\0A    float3 position;\0D\0A    float3 normal;\0D\0A    float3 tangent;\0D\0A    float2 uv;\0D\0A};\0D\0ATexture2D<float4> tex_diffuse : register(t1);\0D\0AStructuredBuffer<VertexAttributes> Vertices : register(t2);\0D\0AByteAddressBuffer Indices : register(t3);\0D\0A\0D\0ASamplerState ss : register(s0);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0Ainline float4 HSVtoRGB(float H, float S, float V) \0D\0A{\0D\0A    float s = S / 100;\0D\0A    float v = V / 100;\0D\0A    float C = s * v;\0D\0A    float X = C * (1 - abs(fmod(H / 60.0, 2) - 1));\0D\0A    float m = v - C;\0D\0A    float r, g, b;\0D\0A    if (H >= 0 && H < 60) {\0D\0A        r = C, g = X, b = 0;\0D\0A    } else if (H >= 60 && H < 120) {\0D\0A        r = X, g = C, b = 0;\0D\0A    } else if (H >= 120 && H < 180) {\0D\0A        r = 0, g = C, b = X;\0D\0A    } else if (H >= 180 && H < 240) {\0D\0A        r = 0, g = X, b = C;\0D\0A    } else if (H >= 240 && H < 300) {\0D\0A        r = X, g = 0, b = C;\0D\0A    } else {\0D\0A        r = C, g = 0, b = X;\0D\0A    }\0D\0A    \0D\0A    return float4((r + m), (g + m), (b + m), 1.f);\0D\0A}\0D\0A\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(g_rayGenCB.projectionToWorld, float4(screenPos, 0, 1));\0D\0A\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_rayGenCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin);\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 100.0;\0D\0A    RayPayload payload = { float4(0, 1, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A// ************************************************\0D\0Auint3 GetIndices(uint offsetBytes)\0D\0A{\0D\0A    uint3 indices;\0D\0A\0D\0A    // ByteAdressBuffer loads must be aligned at a 4 byte boundary.\0D\0A    // Since we need to read three 16 bit indices: { 0, 1, 2 } \0D\0A    // aligned at a 4 byte boundary as: { 0 1 } { 2 0 } { 1 2 } { 0 1 } ...\0D\0A    // we will load 8 bytes (~ 4 indices { a b | c d }) to handle two possible index triplet layouts,\0D\0A    // based on first index's offsetBytes being aligned at the 4 byte boundary or not:\0D\0A    //  Aligned:     { 0 1 | 2 - }\0D\0A    //  Not aligned: { - 0 | 1 2 }\0D\0A    const uint dwordAlignedOffset = offsetBytes & ~3;\0D\0A    const uint2 four16BitIndices = Indices.Load2(dwordAlignedOffset);\0D\0A\0D\0A    // Aligned: { 0 1 | 2 - } => retrieve first three 16bit indices\0D\0A    if (dwordAlignedOffset == offsetBytes)\0D\0A    {\0D\0A        indices.x = four16BitIndices.x & 0xffff;\0D\0A        indices.y = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.z = four16BitIndices.y & 0xffff;\0D\0A    } else // Not aligned: { - 0 | 1 2 } => retrieve last three 16bit indices\0D\0A    {\0D\0A        indices.x = (four16BitIndices.x >> 16) & 0xffff;\0D\0A        indices.y = four16BitIndices.y & 0xffff;\0D\0A        indices.z = (four16BitIndices.y >> 16) & 0xffff;\0D\0A    }\0D\0A\0D\0A    return indices;\0D\0A}\0D\0A\0D\0AVertexAttributes GetVertexAttributes(uint triangleIndex, float3 barycentrics)\0D\0A{\0D\0A    uint indexSizeInBytes = 2;\0D\0A    uint indicesPerTriangle = 3;\0D\0A    uint triangleIndexStride = indicesPerTriangle * indexSizeInBytes;\0D\0A    uint baseIndex = triangleIndex * triangleIndexStride;\0D\0A\0D\0A    uint3 primitive_indices = GetIndices(baseIndex);\0D\0A    VertexAttributes v;\0D\0A    v.position = float3(0, 0, 0);\0D\0A    v.normal = float3(0, 0, 0);\0D\0A    v.tangent = float3(0, 0, 0);\0D\0A    v.uv = float2(0, 0);\0D\0A\0D\0A    for (uint i = 0; i < 3; i++)\0D\0A    {\0D\0A        uint index = primitive_indices[i];\0D\0A        v.position += Vertices[index].position * barycentrics[i];\0D\0A        v.normal += Vertices[index].normal * barycentrics[i];\0D\0A        v.tangent += Vertices[index].tangent * barycentrics[i];\0D\0A        v.uv += Vertices[index].uv * barycentrics[i];\0D\0A    }\0D\0A\0D\0A    v.normal = normalize(v.normal);\0D\0A    v.tangent = normalize(v.tangent);\0D\0A\0D\0A    return v;\0D\0A}\0D\0A// ************************************************\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attrib)\0D\0A{\0D\0A    uint triangleIndex = PrimitiveIndex();\09\0D\0A    float3 barycentrics = float3((1.0f - attrib.barycentrics.x - attrib.barycentrics.y), attrib.barycentrics.x, attrib.barycentrics.y);\0D\0A    VertexAttributes vertex = GetVertexAttributes(triangleIndex, barycentrics);\0D\0A\0D\0A    float3 world_position = mul(float4(vertex.position, 1), ObjectToWorld4x3());\0D\0A    float lambda = log2(length(world_position - g_rayGenCB.cameraPosition.xyz));\0D\0A\0D\0A    // visualize lod level\0D\0A    payload.color = float4(HSVtoRGB(clamp((360.f * lambda / 9.f), 0 , 300), 100, 100));\0D\0A\0D\0A    // visualize dst\0D\0A    //payload.color = HSVtoRGB(clamp(length(world_position - g_rayGenCB.cameraPosition.xyz) * 5, 0, 300), 100, 100);\0D\0A\0D\0A    payload.color = float4(tex_diffuse.SampleLevel(ss, vertex.uv, lambda).rgb, 1.f);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4( 0.0f, 0.4f, 0.2f, 1.0f );\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!137 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl"}
!138 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_5", !"/Fo", !"D:\5CDX12Framework\5Cbin\5CRaytracingSample.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!139 = !{i32 1, i32 5}
!140 = !{i32 1, i32 6}
!141 = !{!"lib", i32 6, i32 5}
!142 = !{!143, !151, !153, !155}
!143 = !{!144, !146, !148, !150}
!144 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !145}
!145 = !{i32 0, i32 4}
!146 = !{i32 1, %"class.Texture2D<vector<float, 4> >"* @"\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", !"tex_diffuse", i32 0, i32 1, i32 1, i32 2, i32 0, !147}
!147 = !{i32 0, i32 9}
!148 = !{i32 2, %"class.StructuredBuffer<VertexAttributes>"* @"\01?Vertices@@3V?$StructuredBuffer@UVertexAttributes@@@@A", !"Vertices", i32 0, i32 2, i32 1, i32 12, i32 0, !149}
!149 = !{i32 1, i32 44}
!150 = !{i32 3, %struct.ByteAddressBuffer* @"\01?Indices@@3UByteAddressBuffer@@A", !"Indices", i32 0, i32 3, i32 1, i32 11, i32 0, null}
!151 = !{!152}
!152 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !147}
!153 = !{!154}
!154 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 96, null}
!155 = !{!156}
!156 = !{i32 0, %struct.SamplerState* @"\01?ss@@3USamplerState@@A", !"ss", i32 0, i32 0, i32 1, i32 0, null}
!157 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !158, %"class.RWTexture2D<vector<float, 4> >" undef, !160, %struct.RaytracingSampleConstantBuffer undef, !165, %"class.Texture2D<vector<float, 4> >" undef, !170, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !172, %"class.StructuredBuffer<VertexAttributes>" undef, !174, %struct.VertexAttributes undef, !179, %struct.ByteAddressBuffer undef, !158, %struct.RayDesc undef, !184, %struct.RayPayload undef, !189, %struct.BuiltInTriangleIntersectionAttributes undef, !191, %g_rayGenCB undef, !193}
!158 = !{i32 4, !159}
!159 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!160 = !{i32 16, !161, !162}
!161 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!162 = !{i32 0, !163}
!163 = !{!164}
!164 = !{i32 0, <4 x float> undef}
!165 = !{i32 96, !166, !168, !169}
!166 = !{i32 6, !"projectionToWorld", i32 2, !167, i32 3, i32 0, i32 7, i32 9}
!167 = !{i32 4, i32 4, i32 2}
!168 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!169 = !{i32 6, !"viewDirection", i32 3, i32 80, i32 7, i32 9}
!170 = !{i32 20, !161, !171, !162}
!171 = !{i32 6, !"mips", i32 3, i32 16}
!172 = !{i32 4, !173}
!173 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!174 = !{i32 56, !175, !176}
!175 = !{i32 6, !"h", i32 3, i32 0}
!176 = !{i32 0, !177}
!177 = !{!178}
!178 = !{i32 0, %struct.VertexAttributes undef}
!179 = !{i32 56, !180, !181, !182, !183}
!180 = !{i32 6, !"position", i32 3, i32 0, i32 7, i32 9}
!181 = !{i32 6, !"normal", i32 3, i32 16, i32 7, i32 9}
!182 = !{i32 6, !"tangent", i32 3, i32 32, i32 7, i32 9}
!183 = !{i32 6, !"uv", i32 3, i32 48, i32 7, i32 9}
!184 = !{i32 32, !185, !186, !187, !188}
!185 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!186 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!187 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!188 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!189 = !{i32 16, !190}
!190 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!191 = !{i32 8, !192}
!192 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!193 = !{i32 96, !194}
!194 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!195 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !196, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !198, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !201}
!196 = !{!197}
!197 = !{i32 1, !2, !2}
!198 = !{!197, !199, !200}
!199 = !{i32 2, !2, !2}
!200 = !{i32 0, !2, !2}
!201 = !{!197, !199}
!202 = !{null, !"", null, !142, !203}
!203 = !{i32 0, i64 65553}
!204 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !205}
!205 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !206}
!206 = !{i32 0}
!207 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !208}
!208 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !206}
!209 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !210}
!210 = !{i32 8, i32 7, i32 5, !206}
!211 = !DILocation(line: 82, column: 23, scope: !32)
!212 = !DILocation(line: 82, column: 5, scope: !32)
!213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !71, file: !1, line: 59, type: !74)
!214 = !DIExpression(DW_OP_bit_piece, 0, 32)
!215 = !DILocation(line: 59, column: 37, scope: !71, inlinedAt: !216)
!216 = distinct !DILocation(line: 82, column: 5, scope: !32)
!217 = !DIExpression(DW_OP_bit_piece, 32, 32)
!218 = !DILocation(line: 61, column: 17, scope: !71, inlinedAt: !216)
!219 = !DILocation(line: 61, column: 23, scope: !71, inlinedAt: !216)
!220 = !DILocation(line: 61, column: 12, scope: !71, inlinedAt: !216)
!221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !71, file: !1, line: 61, type: !24)
!222 = !DILocation(line: 62, column: 29, scope: !71, inlinedAt: !216)
!223 = !DILocation(line: 62, column: 27, scope: !71, inlinedAt: !216)
!224 = !DILocation(line: 62, column: 57, scope: !71, inlinedAt: !216)
!225 = !DILocation(line: 62, column: 63, scope: !71, inlinedAt: !216)
!226 = !DILocation(line: 62, column: 12, scope: !71, inlinedAt: !216)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !71, file: !1, line: 62, type: !24)
!228 = !DILocation(line: 65, column: 19, scope: !71, inlinedAt: !216)
!229 = !DILocation(line: 65, column: 17, scope: !71, inlinedAt: !216)
!230 = !DILocation(line: 68, column: 35, scope: !71, inlinedAt: !216)
!231 = !DILocation(line: 68, column: 20, scope: !71, inlinedAt: !216)
!232 = !DILocation(line: 68, column: 12, scope: !71, inlinedAt: !216)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !71, file: !1, line: 68, type: !4)
!234 = !DIExpression(DW_OP_bit_piece, 64, 32)
!235 = !DIExpression(DW_OP_bit_piece, 96, 32)
!236 = !DILocation(line: 70, column: 15, scope: !71, inlinedAt: !216)
!237 = !DILocation(line: 71, column: 14, scope: !71, inlinedAt: !216)
!238 = !DILocation(line: 71, column: 12, scope: !71, inlinedAt: !216)
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !71, file: !1, line: 59, type: !16)
!240 = !DILocation(line: 59, column: 55, scope: !71, inlinedAt: !216)
!241 = !DILocation(line: 72, column: 37, scope: !71, inlinedAt: !216)
!242 = !DILocation(line: 72, column: 17, scope: !71, inlinedAt: !216)
!243 = !DILocation(line: 72, column: 15, scope: !71, inlinedAt: !216)
!244 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !71, file: !1, line: 59, type: !16)
!245 = !DILocation(line: 59, column: 74, scope: !71, inlinedAt: !216)
!246 = !DILocation(line: 73, column: 1, scope: !71, inlinedAt: !216)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !32, file: !1, line: 79, type: !16)
!248 = !DILocation(line: 79, column: 12, scope: !32)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !32, file: !1, line: 78, type: !16)
!250 = !DILocation(line: 78, column: 12, scope: !32)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !32, file: !1, line: 86, type: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 86, size: 256, align: 32, elements: !253)
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !252, file: !1, line: 86, baseType: !17, size: 96, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !252, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !252, file: !1, line: 86, baseType: !17, size: 96, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !252, file: !1, line: 86, baseType: !8, size: 32, align: 32, offset: 224)
!258 = !DIExpression()
!259 = !DILocation(line: 86, column: 13, scope: !32)
!260 = !DILocation(line: 87, column: 9, scope: !32)
!261 = !DILocation(line: 87, column: 16, scope: !32)
!262 = !DILocation(line: 88, column: 9, scope: !32)
!263 = !DILocation(line: 88, column: 19, scope: !32)
!264 = !DILocation(line: 91, column: 9, scope: !32)
!265 = !DILocation(line: 91, column: 14, scope: !32)
!266 = !DILocation(line: 92, column: 9, scope: !32)
!267 = !DILocation(line: 92, column: 14, scope: !32)
!268 = !DILocation(line: 93, column: 26, scope: !32)
!269 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !32, file: !1, line: 93, type: !61)
!270 = !DILocation(line: 93, column: 16, scope: !32)
!271 = !DILocation(line: 94, column: 5, scope: !32)
!272 = !DILocation(line: 97, column: 18, scope: !32)
!273 = !DILocation(line: 97, column: 5, scope: !32)
!274 = !DILocation(line: 97, column: 42, scope: !32)
!275 = !DILocation(line: 98, column: 1, scope: !32)
!276 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !57, file: !1, line: 162, type: !64)
!277 = !DILocation(line: 162, column: 67, scope: !57)
!278 = !DILocation(line: 164, column: 26, scope: !57)
!279 = !DILocation(line: 164, column: 10, scope: !57)
!280 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndex", scope: !57, file: !1, line: 164, type: !47)
!281 = !DILocation(line: 165, column: 49, scope: !57)
!282 = !DILocation(line: 165, column: 42, scope: !57)
!283 = !DILocation(line: 165, column: 40, scope: !57)
!284 = !DILocation(line: 165, column: 73, scope: !57)
!285 = !DILocation(line: 165, column: 66, scope: !57)
!286 = !DILocation(line: 165, column: 64, scope: !57)
!287 = !DILocation(line: 165, column: 97, scope: !57)
!288 = !DILocation(line: 165, column: 90, scope: !57)
!289 = !DILocation(line: 165, column: 120, scope: !57)
!290 = !DILocation(line: 165, column: 113, scope: !57)
!291 = !DILocation(line: 165, column: 12, scope: !57)
!292 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "barycentrics", scope: !57, file: !1, line: 165, type: !16)
!293 = !DILocation(line: 166, column: 31, scope: !57)
!294 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "triangleIndex", arg: 1, scope: !48, file: !1, line: 131, type: !47)
!295 = !DILocation(line: 131, column: 43, scope: !48, inlinedAt: !296)
!296 = distinct !DILocation(line: 166, column: 31, scope: !57)
!297 = !DILocation(line: 133, column: 10, scope: !48, inlinedAt: !296)
!298 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexSizeInBytes", scope: !48, file: !1, line: 133, type: !47)
!299 = !DILocation(line: 134, column: 10, scope: !48, inlinedAt: !296)
!300 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indicesPerTriangle", scope: !48, file: !1, line: 134, type: !47)
!301 = !DILocation(line: 135, column: 51, scope: !48, inlinedAt: !296)
!302 = !DILocation(line: 135, column: 10, scope: !48, inlinedAt: !296)
!303 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "triangleIndexStride", scope: !48, file: !1, line: 135, type: !47)
!304 = !DILocation(line: 136, column: 36, scope: !48, inlinedAt: !296)
!305 = !DILocation(line: 136, column: 10, scope: !48, inlinedAt: !296)
!306 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseIndex", scope: !48, file: !1, line: 136, type: !47)
!307 = !DILocation(line: 138, column: 31, scope: !48, inlinedAt: !296)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offsetBytes", arg: 1, scope: !35, file: !1, line: 101, type: !47)
!309 = !DILocation(line: 101, column: 23, scope: !35, inlinedAt: !310)
!310 = distinct !DILocation(line: 138, column: 31, scope: !48, inlinedAt: !296)
!311 = !DILocation(line: 112, column: 49, scope: !35, inlinedAt: !310)
!312 = !DILocation(line: 112, column: 16, scope: !35, inlinedAt: !310)
