#if 0
;
; Note: shader requires additional functionality:
;       UAVs at every shader stage
;
; shader debug name: bb970861299ae194b1dacf135e2152d0.pdb
; shader hash: bb970861299ae194b1dacf135e2152d0
;
; Buffer Definitions:
;
; cbuffer g_rayGenCB
; {
;
;   struct g_rayGenCB
;   {
;
;       struct struct.RaytracingSampleConstantBuffer
;       {
;
;           column_major float4x4 projectionToWorld;  ; Offset:    0
;           float4 cameraPosition;                    ; Offset:   64
;       
;       } g_rayGenCB;                                 ; Offset:    0
;
;   
;   } g_rayGenCB;                                     ; Offset:    0 Size:    80
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; g_rayGenCB                        cbuffer      NA          NA     CB0            cb0     1
; Scene                             texture     i32         ras      T0             t0     1
; RenderTarget                          UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%g_rayGenCB = type { %struct.RaytracingSampleConstantBuffer }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !24, globals: !61)
!1 = !DIFile(filename: "..\5C..\5Cshaders\5CRaytracingSample.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 23, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 23, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 53, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 53, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 53, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 53, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 53, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !{!25, !28, !45, !48}
!25 = !DISubprogram(name: "MyRaygenShader", linkageName: "\01?MyRaygenShader@@YAXXZ", scope: !1, file: !1, line: 51, type: !26, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?MyRaygenShader@@YAXXZ")
!26 = !DISubroutineType(types: !27)
!27 = !{null}
!28 = !DISubprogram(name: "MyClosestHitShader", linkageName: "\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 76, type: !29, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !35}
!31 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayPayload", file: !1, line: 29, size: 128, align: 32, elements: !33)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !32, file: !1, line: 31, baseType: !4, size: 128, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "MyAttributes", file: !1, line: 28, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 73, size: 64, align: 32, elements: !37)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !36, file: !1, line: 73, baseType: !39, size: 64, align: 32)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 73, size: 64, align: 32, elements: !40, templateParams: !43)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !39, file: !1, line: 73, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !39, file: !1, line: 73, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !{!13, !44}
!44 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!45 = !DISubprogram(name: "MyMissShader", linkageName: "\01?MyMissShader@@YAXURayPayload@@@Z", scope: !1, file: !1, line: 83, type: !46, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z")
!46 = !DISubroutineType(types: !47)
!47 = !{null, !31}
!48 = !DISubprogram(name: "GenerateCameraRay", linkageName: "\01?GenerateCameraRay@@YAXV?$vector@I$01@@AIAV?$vector@M$02@@1@Z", scope: !1, file: !1, line: 34, type: !49, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51, !59, !59}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 26, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 26, size: 64, align: 32, elements: !53, templateParams: !57)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, line: 26, baseType: !55, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, line: 26, baseType: !55, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!57 = !{!58, !44}
!58 = !DITemplateTypeParameter(name: "element", type: !55)
!59 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!61 = !{!62, !90, !92, !94, !98, !100}
!62 = !DIGlobalVariable(name: "g_rayGenCB", linkageName: "\01?g_rayGenCB@0@3URaytracingSampleConstantBuffer@@B", scope: !0, file: !1, line: 23, type: !63, isLocal: false, isDefinition: true)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingSampleConstantBuffer", file: !1, line: 15, size: 640, align: 32, elements: !65)
!65 = !{!66, !89}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "projectionToWorld", scope: !64, file: !1, line: 17, baseType: !67, size: 512, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 23, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 23, size: 512, align: 32, elements: !69, templateParams: !86)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !68, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!86 = !{!13, !87, !88}
!87 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!88 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cameraPosition", scope: !64, file: !1, line: 18, baseType: !4, size: 128, align: 32, offset: 512)
!90 = !DIGlobalVariable(name: "RAY_FLAG_CULL_BACK_FACING_TRIANGLES", scope: !0, file: !1, line: 69, type: !91, isLocal: true, isDefinition: true, variable: i32 16)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!92 = !DIGlobalVariable(name: "Scene", linkageName: "\01?Scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 21, type: !93, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 21, size: 32, align: 32, elements: !2)
!94 = !DIGlobalVariable(name: "RenderTarget", linkageName: "\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 22, type: !95, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 22, size: 128, align: 32, elements: !2, templateParams: !96)
!96 = !{!97}
!97 = !DITemplateTypeParameter(name: "element", type: !5)
!98 = !DIGlobalVariable(name: "tex_diffuse", linkageName: "\01?tex_diffuse@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 25, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 25, size: 160, align: 32, elements: !2, templateParams: !96)
!100 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 26, type: !101, isLocal: false, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 26, size: 32, align: 32, elements: !2)
!102 = !{i32 2, !"Dwarf Version", i32 4}
!103 = !{i32 2, !"Debug Info Version", i32 3}
!104 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!105 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl", !"//*********************************************************\0D\0A//\0D\0A// Copyright (c) Microsoft. All rights reserved.\0D\0A// This code is licensed under the MIT License (MIT).\0D\0A// THIS CODE IS PROVIDED *AS IS* WITHOUT WARRANTY OF\0D\0A// ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING ANY\0D\0A// IMPLIED WARRANTIES OF FITNESS FOR A PARTICULAR\0D\0A// PURPOSE, MERCHANTABILITY, OR NON-INFRINGEMENT.\0D\0A//\0D\0A//*********************************************************\0D\0A\0D\0A#ifndef RAYTRACING_SAMPLE_HLSL\0D\0A#define RAYTRACING_SAMPLE_HLSL\0D\0A\0D\0Astruct RaytracingSampleConstantBuffer\0D\0A{\0D\0A    float4x4 projectionToWorld;\0D\0A    float4 cameraPosition;\0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure Scene : register(t0, space0);\0D\0ARWTexture2D<float4> RenderTarget : register(u0);\0D\0AConstantBuffer<RaytracingSampleConstantBuffer> g_rayGenCB : register(b0);\0D\0A\0D\0ATexture2D<float4> tex_diffuse : register(t1);\0D\0ASamplerState g_sampler : register(s0);\0D\0A\0D\0Atypedef BuiltInTriangleIntersectionAttributes MyAttributes;\0D\0Astruct RayPayload\0D\0A{\0D\0A    float4 color;\0D\0A};\0D\0A\0D\0Ainline void GenerateCameraRay(uint2 index, out float3 origin, out float3 direction)\0D\0A{\0D\0A    float2 xy = index + 0.5f; // center in the middle of the pixel.\0D\0A    float2 screenPos = xy / DispatchRaysDimensions().xy * 2.0 - 1.0;\0D\0A\0D\0A    // Invert Y for DirectX-style coordinates.\0D\0A    screenPos.y = -screenPos.y;\0D\0A\0D\0A    // Unproject the pixel coordinate into a ray.\0D\0A    float4 world = mul(g_rayGenCB.projectionToWorld, float4(screenPos, 0, 1));\0D\0A\0D\0A    world.xyz /= world.w;\0D\0A    origin = g_rayGenCB.cameraPosition.xyz;\0D\0A    direction = normalize(world.xyz - origin);\0D\0A}\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid MyRaygenShader()\0D\0A{\0D\0A    float3 rayDir;\0D\0A    float3 origin;\0D\0A\0D\0A    // Generate a ray for a camera pixel corresponding to an index from the dispatched 2D grid.\0D\0A    GenerateCameraRay(DispatchRaysIndex().xy, origin, rayDir);\0D\0A\0D\0A    // Trace the ray.\0D\0A    // Set the ray's extents.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = origin;\0D\0A    ray.Direction = rayDir;\0D\0A    // Set TMin to a non-zero small value to avoid aliasing issues due to floating - point errors.\0D\0A    // TMin should be kept small to prevent missing geometry at close contact areas.\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 10.0;\0D\0A    RayPayload payload = { float4(0, 1, 0, 0) };\0D\0A    TraceRay(Scene, RAY_FLAG_CULL_BACK_FACING_TRIANGLES, ~0, 0, 1, 0, ray, payload);\0D\0A\0D\0A    // Write the raytraced color to the output texture.\0D\0A    RenderTarget[DispatchRaysIndex().xy] = payload.color;\0D\0A}\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid MyClosestHitShader(inout RayPayload payload, in MyAttributes attr)\0D\0A{\0D\0A    float3 barycentrics = float3(1 - attr.barycentrics.x - attr.barycentrics.y, attr.barycentrics.x, attr.barycentrics.y);\0D\0A    payload.color = float4(barycentrics, 1);// *tex_diffuse.Load(float2(0.5f, 0.5f));\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid MyMissShader(inout RayPayload payload)\0D\0A{\0D\0A    payload.color = float4( 0.0f, 0.4f, 0.2f, 1.0f );\0D\0A}\0D\0A\0D\0A#endif // RAYTRACING_HLSL"}
!106 = !{!"..\5C..\5Cshaders\5CRaytracingSample.hlsl"}
!107 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"D:\5CDX12Framework\5Cbin\5CRaytracingSample.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!108 = !{i32 1, i32 3}
!109 = !{i32 1, i32 6}
!110 = !{!"lib", i32 6, i32 3}
!111 = !{!112, !115, !118, null}
!112 = !{!113}
!113 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?Scene@@3URaytracingAccelerationStructure@@A", !"Scene", i32 0, i32 0, i32 1, i32 16, i32 0, !114}
!114 = !{i32 0, i32 4}
!115 = !{!116}
!116 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?RenderTarget@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"RenderTarget", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !117}
!117 = !{i32 0, i32 9}
!118 = !{!119}
!119 = !{i32 0, %g_rayGenCB* @g_rayGenCB, !"g_rayGenCB", i32 0, i32 0, i32 1, i32 80, null}
!120 = !{i32 0, %struct.RaytracingAccelerationStructure undef, !121, %"class.RWTexture2D<vector<float, 4> >" undef, !123, %struct.RaytracingSampleConstantBuffer undef, !125, %"class.Texture2D<vector<float, 4> >" undef, !129, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !131, %struct.RayDesc undef, !133, %struct.RayPayload undef, !138, %struct.BuiltInTriangleIntersectionAttributes undef, !140, %g_rayGenCB undef, !142}
!121 = !{i32 4, !122}
!122 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 4}
!123 = !{i32 16, !124}
!124 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!125 = !{i32 80, !126, !128}
!126 = !{i32 6, !"projectionToWorld", i32 2, !127, i32 3, i32 0, i32 7, i32 9}
!127 = !{i32 4, i32 4, i32 2}
!128 = !{i32 6, !"cameraPosition", i32 3, i32 64, i32 7, i32 9}
!129 = !{i32 20, !124, !130}
!130 = !{i32 6, !"mips", i32 3, i32 16}
!131 = !{i32 4, !132}
!132 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!133 = !{i32 32, !134, !135, !136, !137}
!134 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!135 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!136 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!137 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!138 = !{i32 16, !139}
!139 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!140 = !{i32 8, !141}
!141 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!142 = !{i32 80, !143}
!143 = !{i32 6, !"g_rayGenCB", i32 3, i32 0}
!144 = !{i32 1, void ()* @"\01?MyRaygenShader@@YAXXZ", !145, void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !147, void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !150}
!145 = !{!146}
!146 = !{i32 1, !2, !2}
!147 = !{!146, !148, !149}
!148 = !{i32 2, !2, !2}
!149 = !{i32 0, !2, !2}
!150 = !{!146, !148}
!151 = !{null, !"", null, !111, !152}
!152 = !{i32 0, i64 65537}
!153 = !{void (%struct.RayPayload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?MyClosestHitShader@@YAXURayPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !154}
!154 = !{i32 8, i32 10, i32 6, i32 16, i32 7, i32 8, i32 5, !155}
!155 = !{i32 0}
!156 = !{void (%struct.RayPayload*)* @"\01?MyMissShader@@YAXURayPayload@@@Z", !"\01?MyMissShader@@YAXURayPayload@@@Z", null, null, !157}
!157 = !{i32 8, i32 11, i32 6, i32 16, i32 5, !155}
!158 = !{void ()* @"\01?MyRaygenShader@@YAXXZ", !"\01?MyRaygenShader@@YAXXZ", null, null, !159}
!159 = !{i32 8, i32 7, i32 5, !155}
!160 = !DILocation(line: 57, column: 23, scope: !25)
!161 = !DILocation(line: 57, column: 5, scope: !25)
!162 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 1, scope: !48, file: !1, line: 34, type: !51)
!163 = !DIExpression(DW_OP_bit_piece, 0, 32)
!164 = !DILocation(line: 34, column: 37, scope: !48, inlinedAt: !165)
!165 = distinct !DILocation(line: 57, column: 5, scope: !25)
!166 = !DIExpression(DW_OP_bit_piece, 32, 32)
!167 = !DILocation(line: 36, column: 17, scope: !48, inlinedAt: !165)
!168 = !DILocation(line: 36, column: 23, scope: !48, inlinedAt: !165)
!169 = !DILocation(line: 36, column: 12, scope: !48, inlinedAt: !165)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xy", scope: !48, file: !1, line: 36, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 36, baseType: !39)
!172 = !DILocation(line: 37, column: 29, scope: !48, inlinedAt: !165)
!173 = !DILocation(line: 37, column: 27, scope: !48, inlinedAt: !165)
!174 = !DILocation(line: 37, column: 57, scope: !48, inlinedAt: !165)
!175 = !DILocation(line: 37, column: 63, scope: !48, inlinedAt: !165)
!176 = !DILocation(line: 37, column: 12, scope: !48, inlinedAt: !165)
!177 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "screenPos", scope: !48, file: !1, line: 37, type: !171)
!178 = !DILocation(line: 40, column: 19, scope: !48, inlinedAt: !165)
!179 = !DILocation(line: 40, column: 17, scope: !48, inlinedAt: !165)
!180 = !DILocation(line: 43, column: 35, scope: !48, inlinedAt: !165)
!181 = !DILocation(line: 43, column: 20, scope: !48, inlinedAt: !165)
!182 = !DILocation(line: 43, column: 12, scope: !48, inlinedAt: !165)
!183 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "world", scope: !48, file: !1, line: 43, type: !4)
!184 = !DIExpression(DW_OP_bit_piece, 64, 32)
!185 = !DIExpression(DW_OP_bit_piece, 96, 32)
!186 = !DILocation(line: 45, column: 15, scope: !48, inlinedAt: !165)
!187 = !DILocation(line: 46, column: 14, scope: !48, inlinedAt: !165)
!188 = !DILocation(line: 46, column: 12, scope: !48, inlinedAt: !165)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "origin", arg: 2, scope: !48, file: !1, line: 34, type: !16)
!190 = !DILocation(line: 34, column: 55, scope: !48, inlinedAt: !165)
!191 = !DILocation(line: 47, column: 37, scope: !48, inlinedAt: !165)
!192 = !DILocation(line: 47, column: 17, scope: !48, inlinedAt: !165)
!193 = !DILocation(line: 47, column: 15, scope: !48, inlinedAt: !165)
!194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "direction", arg: 3, scope: !48, file: !1, line: 34, type: !16)
!195 = !DILocation(line: 34, column: 74, scope: !48, inlinedAt: !165)
!196 = !DILocation(line: 48, column: 1, scope: !48, inlinedAt: !165)
!197 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "origin", scope: !25, file: !1, line: 54, type: !16)
!198 = !DILocation(line: 54, column: 12, scope: !25)
!199 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rayDir", scope: !25, file: !1, line: 53, type: !16)
!200 = !DILocation(line: 53, column: 12, scope: !25)
!201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !25, file: !1, line: 61, type: !202)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 61, size: 256, align: 32, elements: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !202, file: !1, line: 61, baseType: !17, size: 96, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !202, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !202, file: !1, line: 61, baseType: !17, size: 96, align: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !202, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 224)
!208 = !DIExpression()
!209 = !DILocation(line: 61, column: 13, scope: !25)
!210 = !DILocation(line: 62, column: 9, scope: !25)
!211 = !DILocation(line: 62, column: 16, scope: !25)
!212 = !DILocation(line: 63, column: 9, scope: !25)
!213 = !DILocation(line: 63, column: 19, scope: !25)
!214 = !DILocation(line: 66, column: 9, scope: !25)
!215 = !DILocation(line: 66, column: 14, scope: !25)
!216 = !DILocation(line: 67, column: 9, scope: !25)
!217 = !DILocation(line: 67, column: 14, scope: !25)
!218 = !DILocation(line: 68, column: 26, scope: !25)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !25, file: !1, line: 68, type: !32)
!220 = !DILocation(line: 68, column: 16, scope: !25)
!221 = !DILocation(line: 69, column: 5, scope: !25)
!222 = !DILocation(line: 72, column: 18, scope: !25)
!223 = !DILocation(line: 72, column: 5, scope: !25)
!224 = !DILocation(line: 72, column: 42, scope: !25)
!225 = !DILocation(line: 73, column: 1, scope: !25)
!226 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !28, file: !1, line: 76, type: !35)
!227 = !DILocation(line: 76, column: 67, scope: !28)
!228 = !DILocation(line: 78, column: 43, scope: !28)
!229 = !DILocation(line: 78, column: 38, scope: !28)
!230 = !DILocation(line: 78, column: 36, scope: !28)
!231 = !DILocation(line: 78, column: 65, scope: !28)
!232 = !DILocation(line: 78, column: 60, scope: !28)
!233 = !DILocation(line: 78, column: 58, scope: !28)
!234 = !DILocation(line: 78, column: 86, scope: !28)
!235 = !DILocation(line: 78, column: 81, scope: !28)
!236 = !DILocation(line: 78, column: 107, scope: !28)
!237 = !DILocation(line: 78, column: 102, scope: !28)
!238 = !DILocation(line: 78, column: 12, scope: !28)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "barycentrics", scope: !28, file: !1, line: 78, type: !16)
!240 = !DILocation(line: 79, column: 28, scope: !28)
!241 = !DILocation(line: 79, column: 19, scope: !28)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !28, file: !1, line: 76, type: !32)
!243 = !DILocation(line: 76, column: 42, scope: !28)
!244 = !DILocation(line: 80, column: 1, scope: !28)
!245 = !DILocation(line: 85, column: 19, scope: !45)
!246 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !45, file: !1, line: 83, type: !32)
!247 = !DILocation(line: 83, column: 36, scope: !45)
!248 = !DILocation(line: 86, column: 1, scope: !45)

#endif

const unsigned char g_pRaytracingSample[] = {
  0x44, 0x58, 0x42, 0x43, 0x58, 0xed, 0xf9, 0xb6, 0xdb, 0xd6, 0x9a, 0xf7,
  0x6a, 0xa3, 0x9d, 0x4d, 0x9a, 0x95, 0x6f, 0x67, 0x01, 0x00, 0x00, 0x00,
  0x74, 0x55, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0x6c, 0x02, 0x00, 0x00, 0x84, 0x37, 0x00, 0x00,
  0xe0, 0x44, 0x00, 0x00, 0x14, 0x45, 0x00, 0x00, 0x30, 0x45, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0x18, 0x02, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0xfc, 0x00, 0x00, 0x00, 0x6c, 0x01, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0xdc, 0x00, 0x00, 0x00, 0x00, 0x67, 0x5f, 0x72,
  0x61, 0x79, 0x47, 0x65, 0x6e, 0x43, 0x42, 0x00, 0x53, 0x63, 0x65, 0x6e,
  0x65, 0x00, 0x52, 0x65, 0x6e, 0x64, 0x65, 0x72, 0x54, 0x61, 0x72, 0x67,
  0x65, 0x74, 0x00, 0x01, 0x3f, 0x4d, 0x79, 0x52, 0x61, 0x79, 0x67, 0x65,
  0x6e, 0x53, 0x68, 0x61, 0x64, 0x65, 0x72, 0x40, 0x40, 0x59, 0x41, 0x58,
  0x58, 0x5a, 0x00, 0x4d, 0x79, 0x52, 0x61, 0x79, 0x67, 0x65, 0x6e, 0x53,
  0x68, 0x61, 0x64, 0x65, 0x72, 0x00, 0x01, 0x3f, 0x4d, 0x79, 0x43, 0x6c,
  0x6f, 0x73, 0x65, 0x73, 0x74, 0x48, 0x69, 0x74, 0x53, 0x68, 0x61, 0x64,
  0x65, 0x72, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x52, 0x61, 0x79, 0x50,
